package com.example.assignment06_2

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import kotlinx.android.synthetic.main.activity_main.*

const val EXTRA_MESSAGE = "com.example.Assignment06_1.MESSAGE"
class MainActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        Pic1.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "รุ่นแรกที่ เราอยากจะขอแนะนำให้คุณได้ลองเลือกซื้อกันในวันนี้ จะเป็นสินค้าจากแบรนด์อุปกรณ์เกมมิ่งชื่อดังระดับโลก Logitech ที่มีดีไซน์การออกแบบสุดเรียบง่ายและทันสมัย ในขณะที่ยังคงดูสวยงามเรียบหรูและดูมีราคาไปด้วยในเวลาเดียวกัน โดยที่ในส่วนของค่าความเร็วในการเคลื่อนไหวของเมาส์นั้นจะอยู่ที่ประมาณ 16,000 DPI ส่งผลให้คุณสามารถเล่นเกมที่ชื่นชอบได้อย่างลื่นไหลและไม่มีสะดุด นอกจากนี้ยังใช้งานได้อย่างสะดวกสบายผ่านการใช้งานการเชื่อมต่อระบบไร้สาย ด้วยการเชื่อมต่ออุปกรณ์ส่งสัญญาผ่านทางพอร์ตเชื่อมต่อแบบ USB ด้วยเช่นกันครับ")

            startActivity(intent)
        }

        Pic2.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "สำหรับคนที่กำลังมองหาเมาส์เล่นเกมในปี 2022 นี้ หนึ่งในรุ่นที่เราอยากจะแนะนำของคุณลองตรวจสอบถึงรายละเอียดโดยรวมของตัวสินค้า คือ Logitech G Pro Wireless Gaming Mouse ซึ่งเป็นรุ่นระดับสูงที่มาพร้อมค่าความเร็วในการสั่งการเคอร์เซอร์มากถึง 16,000 DPI และมีความโดดเด่นสำคัญอยู่ในเรื่องของปุ่มตัวเลขด้านข้าง ที่ใช้สำหรับการสั่งการฟังก์ชันต่าง ๆ ในรูปแบบของตัวเลข ที่สำคัญในด้านของน้ำหนักก็ยังมีอยู่เพียงแค่ 160 กรัม รวมไปถึงยังจับถือได้อย่างง่ายดายและถนัดมือ จากดีไซน์การออกแบบที่มีความเล็กกะทัดรัดและไม่ใหญ่มากจนเกินไปอีกด้วยครับ")

            startActivity(intent)
        }

        Pic3.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "SteelSeries Rival 3 เป็นอีกหนึ่งเมาส์เกมมิ่งที่ถูกผลิตขึ้นจากแบรนด์อุปกรณ์เกมมิ่งชื่อดัง และมีผู้ใช้งานเลือกซื้ออยู่เป็นจำนวนมากสำหรับการเล่นเกมในช่วงเวลาปัจจุบัน ทั้งจากรูปลักษณ์การออกแบบที่มีความสวยงามทันสมัย และความทนทานในการใช้งานตัวสินค้าที่ทางแบรนด์รับรองการใช้งาน ด้วยจำนวนการคลิ๊กสูงสุดที่สามารถทำได้มากถึง 60 ล้านครั้ง แต่เพื่อให้คุณใช้งานตัวอุปกรณ์ได้อย่างยาวนานและมั่นใจได้มากยิ่งขึ้น ยังเป็นส่วนที่ทำให้ทางแบรนด์มีการแถมการรับประกันตัวอุปกรณ์มามากถึง 1 ปีหลังการใช้งานเลยทีเดียวครับ")

            startActivity(intent)
        }

        Pic4.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE,  "หากคุณต้องการรุ่น เมาส์เกมมิ่ง ที่มีดีไซน์การออกแบบสวยงามล้ำสมัย และสามารถจัดวางเข้าชุดได้กับอุปกรณ์เกมมิ่งที่คุณมีอยู่อย่างไม่ขัดสายตา รุ่นนี้น่าจะเป็นอีกหนึ่งรุ่นที่เหมาะสมกับคุณเป็นอย่างมาก โดยที่นอกจากจะมีความสวยงามในด้านของดีไซน์การออกแบบแล้ว ในเรื่องของประสิทธิภาพการใช้งานก็นับว่าทำได้ดีไม่แพ้กันกับเรื่องอื่น ๆ ด้วยเช่นกัน จากการถูกออกแบบให้จับถือได้ง่ายดายตามหลักสรีรศาสตร์ และวัสดุในการผลิตแบบโพลีเตตราฟลูออโรเอธิลีน ที่มีคุณสมบัติในการลดแรงเสียดทานได้อย่างยอดเยี่ยม ดังนั้นในระหว่างการใช้งานจึงทำให้คุณเล่นเกมได้แบบลื่นไหลและไม่มีสะดุดเลยแม้แต่น้อยครับ")

            startActivity(intent)
        }

        Pic5.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "NUBWO ARCADIA X55 เป็นเมาส์เล่นเกมแบบมาโครที่ถูกตกแต่งออกมาอย่างสวยงาม ด้วยการใช้ระบบไฟสีรุ้งแบบ RGB ที่กำลังเป็นเทรนด์การออกแบบอุปกรณ์สายเกมมิ่ง ซึ่งได้รับความนิยมอยู่ไม่น้อยในช่วงปัจจุบันนี้ และจากความแม่นยำของการสั่งการตัวอุปกรณ์จากค่า DPI ที่มีอยู่มากถึง 10,000 หน่วย ไปจนถึงปุ่มกดขนาดเล็กด้านข้างของตัวอุปกรณ์ ที่ถูกออกแบบมาให้คุณสั่งการสิ่งต่าง ๆ ได้รวดเร็วและง่ายดายมากยิ่งขึ้น ก็น่าจะเป็นส่วนที่ทำให้เกมเมอร์หลาย ๆ คนสนใจในการหาสินค้ารุ่นนี้มาไว้สำหรับการเล่นเกมภายในบ้านของตนเองเป็นอย่างมากเลยทีเดียวครับ")

            startActivity(intent)
        }

        Pic6.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "RAZER MOUSE DEATHADDER V2 คือ เมาส์ ขนาดเล็กจากแบรนด์ RAZER ที่มีจุดเด่นสำคัญอยู่ในเรื่องของดีไซน์การออกแบบ ซึ่งถูกคำนวณออกมาอย่างยอดเยี่ยม เพื่อให้คุณเล่นเกมที่ชื่นชอบในชีวิตประจำวันได้อย่างมีอรรถมากสุดเท่าที่จะเป็นไปได้ ด้วยรูปทรงที่สวยงามและจับถนัดมือได้อย่างเต็มประสิทธิภาพ ยิ่งไปกว่านั้นหากกล่าวถึงในด้านของความรวดเร็วและความแม่นยำในการสั่งการตัวอุปกรณ์ ก็เรียกได้ว่ารุ่นนี้เป็นหนึ่งในรุ่นที่ทำได้แบบยอดเยี่ยม จากค่าความเร็วในการสั่งการของเมาส์ ที่มีอยู่มากถึง 20,000 หน่วยด้วยเช่นกันครับ")

            startActivity(intent)
        }

        Pic7.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "Redragon COBRA M711 FPS เรียกได้ว่าเป็นอีกหนึ่งรุ่นที่ถูกออกแบบด้วยระบบไฟแบบ RGB เช่นเดียวกันกับในหลาย ๆ รุ่นที่ผ่านมา และมีรูปลักษณ์สุดสวยงามทันสมัยที่สามารถจับถือได้อย่างถนัดมือ ซึ่งช่วยให้คุณเล่นเกมที่ชื่นชอบต่อเนื่องไปได้อย่างยาวนานโดยไม่เมื่อยล้า นอกจากนี้เพื่อให้การเล่นเกมทำได้ลื่นไหลมากยิ่งขึ้นอย่างมีประสิทธิภาพ จึงทำให้เมาส์รุ่นนี้มีการออกแบบให้มีค่าความเร็วและแม่นยำในการใช้งานมาสูงสุดถึง 24,000 DPI รวมไปถึงยังมีปุ่มกดที่เลือกปรับระดับความเร็วในการใช้งานได้แบบรวดเร็วอีกด้วยครับ")

            startActivity(intent)
        }

        Pic8.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "ต่อมาเป็นรุ่นราคาประหยัดจากแบรนด์ FANTECH ที่เลือกปรับค่าความเร็วในการใช้งานได้ตั้งแต่ 200 ไปจนถึง 4,800 DPI และรองรับการใช้งานไปได้อย่างยาวนาน ด้วยการการันตีจำนวนการคลิ๊กที่ทำได้สูงสุดถึง 5 ล้านครั้ง มาพร้อมสายถักที่ความยาวสูงสุด 1.7 เมตร เพื่อให้คุณเชื่อมต่อเข้ากับตัวเครื่องคอมพิวเตอร์ได้อย่างไม่มีสะดุด ในระยะที่คุณต้องการไปด้วยในเวลาเดียวกัน ที่สำคัญในด้านของดีไซน์การออกแบบก็ยังนับเป็นอีกหนึ่งรุ่น ที่ถูกตกแต่งออกมาอย่างสวยงามด้วยการใช้งานระบบไฟสีรุ้งแบบ RGB ซึ่งเลือกปรับโหมดในการแสดงผลไฟได้มากถึง 12 แบบด้วยนั่นเองครับ")

            startActivity(intent)
        }

        Pic9.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "EGA Type M7 เรียกได้ว่าเป็นหนึ่งในรุ่นของเมาส์เกมมิ่ง ที่ใช้งานระบบไฟแบบ RGB ในการตกแต่งตัวอุปกรณ์ เพื่อให้รูปลักษณ์การออกแบบของเมาส์มีความโดดเด่นสวยงาม และแตกต่างออกมาจากรุ่นอื่น ๆ อีกพอสมควร โดยในส่วนของค่า DPI ที่ให้มาสำหรับการใช้งานของอุปกรณ์ตัวนี้นั้นจะอยู่ที่ประมาณ 10,000 หน่วย ซึ่งช่วยให้คุณได้รับประสบการณ์ในการเล่นเกมที่ชื่นชอบได้แบบลื่นไหลมากที่สุด ยิ่งไปกว่านั้นด้วยการใช้งานเทคโนโลยี Huano Switches ที่ถูกพัฒนาขึ้นมาจากทางแบรนด์เอง ยังเป็นผลให้รุ่นนี้รองรับการคลิ๊กได้ในจำนวนสูงสุดถึง 20 ล้านครั้งเลยทีเดียวครับ")

            startActivity(intent)
        }

        Pic10.setOnClickListener {
            val intent = Intent(this, MainActivity2::class.java)
            intent.putExtra(EXTRA_MESSAGE, "สุดท้ายเป็น เมาส์เกมมิ่ง ที่จับถือได้อย่างถนัดมือ ด้วยรูปลักษณ์ดีไซน์ที่มีขนาดใหญ่และดูโฉบเฉี่ยวมีสไตล์ออกมาจากรุ่นอื่น ๆ อยู่พอสมควร ซึ่งในส่วนของค่าความเร็วในการใช้งานของเมาส์รุ่นนี้ จะทำได้อย่างหลากหลายในช่วงเริ่มต้น 800 DPI ไปจนถึงสูงสุดที่ประมาณ 2,400 DPI ส่วนในด้านของการเชื่อมต่อเข้ากันกับอุปกรณ์หลัก ก็ทำได้อย่างไม่ติดขัดจากความยาวสายที่ให้มากมาถึง 1.5 เมตร รวมไปถึงในด้านของอายุการใช้งาน ก็มาพร้อมจำนวนการคลิ๊กสูงสุดที่ทำได้มากถึง 3 ล้านครั้ง ส่งผลให้เมื่อได้รับสินค้าตัวนี้ไปแล้วคุณจะใช้งานต่อเนื่องได้ยาวนานตลอดหลายปีอย่างแน่นอนครับ")

            startActivity(intent)
        }
    }
}